simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/calibration.c
    for (i = 0u; i < 3u; i++) {
        stage->write(sweep_dac[i]);
        CyDelay(CAL_DIAG_SWEEP_SETTLE_MS);
        cal_diag(PSOC_EVT_CAL_SWEEP_DAC, sweep_dac[i]);
        cal_diag_i32(PSOC_EVT_CAL_SWEEP_MEAS32, cal_adc_read_direct_counts());
    }
}
#endif

static uint8 cal_stage_min_dac(const PsocCalStage *stage)
{
    return (stage->dac_center > stage->dac_max_change)
        ? (uint8)(stage->dac_center - stage->dac_max_change)
        : 0u;
}

static uint8 cal_stage_max_dac(const PsocCalStage *stage)
{
    uint16 max_dac = (uint16)stage->dac_center + (uint16)stage->dac_max_change;
    return (max_dac > 255u) ? 255u : (uint8)max_dac;
}

static uint8 cal_stage_clamp_dac(const PsocCalStage *stage, uint8 dac)
{
    uint8 lo = cal_stage_min_dac(stage);
    uint8 hi = cal_stage_max_dac(stage);
    if (dac < lo) { return lo; }
    if (dac > hi) { return hi; }
    return dac;
}

static uint8 cal_stage_center_dac(const PsocCalStage *stage)
{
    return cal_stage_clamp_dac(stage, stage->dac_center);
}

PsocCalResult g_psoc_cal_results[PSOC_CAL_MAX_STAGES];
uint8 g_psoc_cal_result_count = 0u;

#define CAL_ASYNC_EMPTY_POLL_LIMIT 2000000UL

/* Watchdog global expresado como ticks legacy de 10 ms para mantener la escala
 * de configuracion anterior; en runtime lo ejecuta Timer_3 como one-shot. */
#ifndef CAL_WATCHDOG_TICKS
#define CAL_WATCHDOG_TICKS 40000UL
#endif

/* Periodo de telemetria de progreso (ticks legacy de 10 ms => ~500 ms). */
#define CAL_PROGRESS_PERIOD_TICKS 50UL
#define CAL_LEGACY_TICK_MS 10UL
#define CAL_WATCHDOG_MS (CAL_WATCHDOG_TICKS * CAL_LEGACY_TICK_MS)
#define CAL_PROGRESS_PERIOD_MS (CAL_PROGRESS_PERIOD_TICKS * CAL_LEGACY_TICK_MS)

/* Muestras del PI que se envian al ESP durante calibracion. No puede ser cada
 * muestra a 3 kHz: cada valor int32 viaja como 4 eventos UART. */
#ifndef CAL_PI_TELEM_PERIOD
#define CAL_PI_TELEM_PERIOD 256u
#endif

#ifndef CAL_PI_HAMMER_PASS_COUNT
#define CAL_PI_HAMMER_PASS_COUNT 1u
#endif

#if PSOC_HW_CLASS == PSOC_HW_HAMMER
#define CAL_PI_PASS_COUNT CAL_PI_HAMMER_PASS_COUNT
#else
#define CAL_PI_PASS_COUNT 1u
#endif

#ifndef CAL_DIAG_SWEEP_ENABLE
#define CAL_DIAG_SWEEP_ENABLE 0u
#endif

#ifndef CAL_DIAG_SWEEP_SETTLE_MS
#define CAL_DIAG_SWEEP_SETTLE_MS 30u
#endif

typedef enum {
    CAL_ASYNC_IDLE = 0u,
    CAL_ASYNC_DONE
} PsocCalAsyncState;

typedef struct {
    PsocCalAsyncState state;
    uint8 busy;
    uint8 done;
    uint8 ok;
    uint8 stage_index;
    uint8 pass_index;
} PsocCalAsync;

static PsocCalAsync g_cal_async = { CAL_ASYNC_IDLE };

#if CAL_ALGO_SERVO_ENABLE /* servo lento legacy -- comentado a pedido del usuario, ver
       * stubs no-op de psoc_calibration_servo_* mas abajo */
typedef enum {
    CAL_SERVO_IDLE = 0u,
    CAL_SERVO_MEASURE
} PsocCalServoState;

typedef struct {
    uint8 enabled;
    PsocCalServoState state;
    uint8 stage_index;
    uint8 dac;
    int32 acc;
    int32 cum_sum;
    int32 cum_count;
    int32 prev_avg;
    uint16 avg_count;
    uint16 discard_count;
    uint8 settle_windows;
    uint8 have_prev_avg;
    uint32 empty_polls;
    uint32 next_due_ticks;

    uint8 have_last[PSOC_CAL_MAX_STAGES];
    uint8 last_dac[PSOC_CAL_MAX_STAGES];
    int32 last_measured[PSOC_CAL_MAX_STAGES];
    uint8 have_slope[PSOC_CAL_MAX_STAGES];
    uint8 increasing[PSOC_CAL_MAX_STAGES];
    uint8 trial_active[PSOC_CAL_MAX_STAGES];
    uint8 prev_dac[PSOC_CAL_MAX_STAGES];
    int32 prev_abs_error[PSOC_CAL_MAX_STAGES];
    int8 last_dir[PSOC_CAL_MAX_STAGES];
    int32 integral[PSOC_CAL_MAX_STAGES];
} PsocCalServo;

typedef struct {
    int32 kp_num;
    int32 ki_num;
    int32 ki_div;
    int32 deadband_counts;
    uint8 fine_step;
    uint8 recovery_step;
} PsocCalServoTune;

static PsocCalServo g_cal_servo = { CAL_SERVO_ENABLE_DEFAULT };

static const PsocCalServoTune g_cal_servo_tune[PSOC_CAL_STAGE_COUNT] = {
#if PSOC_HW_CLASS == PSOC_HW_GEO
    { CAL_SERVO_KP_NUM_GEO_PGA,   CAL_SERVO_KI_NUM_GEO_PGA,   CAL_SERVO_KI_DIV_GEO_PGA,   CAL_SERVO_DEADBAND_GEO_PGA,   CAL_SERVO_FINE_STEP_GEO_PGA,   CAL_SERVO_RECOVERY_STEP_GEO_PGA },
#if defined(VDAC_ref_BP_DEFAULT_DATA) || defined(CY_DVDAC_VDAC_ref_BP_H)
    { CAL_SERVO_KP_NUM_GEO_BP,    CAL_SERVO_KI_NUM_GEO_BP,    CAL_SERVO_KI_DIV_GEO_BP,    CAL_SERVO_DEADBAND_GEO_BP,    CAL_SERVO_FINE_STEP_GEO_BP,    CAL_SERVO_RECOVERY_STEP_GEO_BP },
#endif
    { CAL_SERVO_KP_NUM_GEO_SUM,   CAL_SERVO_KI_NUM_GEO_SUM,   CAL_SERVO_KI_DIV_GEO_SUM,   CAL_SERVO_DEADBAND_GEO_SUM,   CAL_SERVO_FINE_STEP_GEO_SUM,   CAL_SERVO_RECOVERY_STEP_GEO_SUM },
    { CAL_SERVO_KP_NUM_GEO_LP,    CAL_SERVO_KI_NUM_GEO_LP,    CAL_SERVO_KI_DIV_GEO_LP,    CAL_SERVO_DEADBAND_GEO_LP,    CAL_SERVO_FINE_STEP_GEO_LP,    CAL_SERVO_RECOVERY_STEP_GEO_LP },
#else
    { CAL_SERVO_KP_NUM_HAMMER_PGA, CAL_SERVO_KI_NUM_HAMMER_PGA, CAL_SERVO_KI_DIV_HAMMER_PGA, CAL_SERVO_DEADBAND_HAMMER_PGA, CAL_SERVO_FINE_STEP_HAMMER_PGA, CAL_SERVO_RECOVERY_STEP_HAMMER_PGA },
    { CAL_SERVO_KP_NUM_HAMMER_LP,  CAL_SERVO_KI_NUM_HAMMER_LP,  CAL_SERVO_KI_DIV_HAMMER_LP,  CAL_SERVO_DEADBAND_HAMMER_LP,  CAL_SERVO_FINE_STEP_HAMMER_LP,  CAL_SERVO_RECOVERY_STEP_HAMMER_LP },
#endif
};
#endif /* #if 0 -- servo lento legacy */

#if CAL_ALGO_SERVO_ENABLE
static int32 cal_servo_clip_integral(int32 value)
{
    if (value > CAL_SERVO_INTEGRAL_LIMIT) { return CAL_SERVO_INTEGRAL_LIMIT; }
    if (value < -CAL_SERVO_INTEGRAL_LIMIT) { return -CAL_SERVO_INTEGRAL_LIMIT; }
    return value;
}
#endif

#if CAL_ALGO_SERVO_ENABLE /* servo lento legacy -- ver nota junto a CAL_SERVO_IDLE mas arriba */
static uint16 cal_servo_settle_samples(uint8 stage_index)
{
#if PSOC_HW_CLASS == PSOC_HW_GEO
    switch (stage_index) {
        case 0u: return CAL_SERVO_SETTLE_SAMPLES_GEO_PGA;
#if defined(VDAC_ref_BP_DEFAULT_DATA) || defined(CY_DVDAC_VDAC_ref_BP_H)
        case 1u: return CAL_SERVO_SETTLE_SAMPLES_GEO_BP;
        case 2u: return CAL_SERVO_SETTLE_SAMPLES_GEO_SUM;
#else
        case 1u: return CAL_SERVO_SETTLE_SAMPLES_GEO_SUM;
#endif
        default: return CAL_SERVO_SETTLE_SAMPLES_GEO_LP;
    }
#else
    switch (stage_index) {
        case 0u: return CAL_SERVO_SETTLE_SAMPLES_HAMMER_PGA;
        default: return CAL_SERVO_SETTLE_SAMPLES_HAMMER_LP;
    }
#endif
}
#endif /* #if 0 -- servo lento legacy */

static uint8 cal_stage_current_dac(uint8 stage_index)
{
    if (stage_index >= g_psoc_cal_result_count) {
        return cal_stage_center_dac(&g_psoc_cal_stages[stage_index]);
    }
    return cal_stage_clamp_dac(&g_psoc_cal_stages[stage_index],
                               g_psoc_cal_results[stage_index].final_dac);
}

static void cal_stage_write_result(uint8 stage_index, uint8 dac)
{
    if (stage_index < PSOC_CAL_STAGE_COUNT) {
        uint8 clamped = cal_stage_clamp_dac(&g_psoc_cal_stages[stage_index], dac);
        g_psoc_cal_stages[stage_index].write(clamped);
        g_psoc_cal_results[stage_index].final_dac = clamped;
        if (g_psoc_cal_result_count < PSOC_CAL_STAGE_COUNT) {
            g_psoc_cal_result_count = PSOC_CAL_STAGE_COUNT;
        }
    }
}

